IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/FSIRX4_CFG.xml
<module name="FSIRX4_CFG" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CFG_RX_MASTER_CTRL_ALTB_" acronym="CFG_RX_MASTER_CTRL_ALTB_" offset="0x0" width="16" description="Receive master control register">
		<bitfield id="KEY" width="8" begin="15" end="8" resetval="0x0" description="Write Key.In order to write to this register, 0xA5 must be written to this field at the same time. Otherwise, writes are ignored. The key is cleared immediately after writing, so it must be written again for every change to this register." range="15 - 8" rwaccess="W"/> 
		<bitfield id="INPUT_ISOLATE" width="1" begin="3" end="3" resetval="0x0" description="When set to 1, the FSI RX inputs [RXCLK, RXD0 and RXD1] will be isolated from what is driven from the device pins and will be held at inactive level of '1'.This isolation facilitates the user to switch the RX inputs to a different set of device pins and hence any potential glitch that could occur during the process of switching will not affect the RX module itself." range="3" rwaccess="R/W"/> 
		<bitfield id="SPI_PAIRING" width="1" begin="2" end="2" resetval="0x0" description="Clock Pairing for SPI-like Behavior Enable bitThis bit enables the internal clock pairing with the FSI TX module. This feature internally connects the TXCLK to RXCLK allowing the FSI TX module, acting as a SPI master, to clock data into the receiver and out of the transmitter like a standard SPI module. This configuration is valid when the Module is in SPI mode only [RX_OPER_CTRL.SPI_MODE = 1] 0h [R/W] = SPI clock pairing is not enabled.1h [R/W] = SPI clock pairing is enabled. The RXCLK will be internally connected to the TXCLK of the corresponding FSI module. Note: The KEY field must contatin 0xA5 for any write to this bit to take effect." range="2" rwaccess="R/W"/> 
		<bitfield id="INT_LOOPBACK" width="1" begin="1" end="1" resetval="0x0" description="Internal Loopback Enable bitThis bit enables the internal loopback functionality of the FSI receiver. By enabling this bit, a mux will select the signals coming directly from the corresponding FSI transmitter module rather than from the pins. 0h [R/W] = Internal loopback is disabled. The FSI RX module will receive signals coming from the pins.1h [R/W] = Internal loopback is enabled. The FSI RX module will receive signals from the directly from FSI TX module rather than the pins. Note: The KEY field must contatin 0xA5 for any write to this bit to take effect." range="1" rwaccess="R/W"/> 
		<bitfield id="CORE_RST" width="1" begin="0" end="0" resetval="0x0" description="Receiver Master Core Reset bitThis bit controls the receiver master core reset. In order to receive any frame, this bit must be cleared.Note: For reset to take affect, the FSI RX module must be held in reset for at least 4 SYSCLK cycles. 0h [R/W] = Receiver core is not in reset and can receive frames.1h [R/W] = Receiver core is held in reset. Note: The KEY field must contatin 0xA5 for any write to this bit to take effect." range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_Reserved_1" acronym="CFG_Reserved_1" offset="0x2" width="16" description="">
		
	</register>
	<register id="CFG_Reserved_2" acronym="CFG_Reserved_2" offset="0x4" width="16" description="">
		
	</register>
	<register id="CFG_Reserved_3" acronym="CFG_Reserved_3" offset="0x6" width="16" description="">
		
	</register>
	<register id="CFG_RX_OPER_CTRL" acronym="CFG_RX_OPER_CTRL" offset="0x8" width="16" description="Receive operation control register. Protected by LOCK field in RX_LOCK_CTRL register.">
		<bitfield id="PING_WD_RST_MODE" width="1" begin="8" end="8" resetval="0x0" description="Ping Watchdog Timeout Mode Select bitThis bit selects the mode by which the ping watchdog counter is reset. The watchdog counter can be reset and restarted only by ping frames or by any received frame. 0h [R/W] = The ping watchdog counter will reset and restart only by ping frames.1h [R/W] = The ping watchdog counter will reset and restart by any received frame." range="8" rwaccess="R/W"/> 
		<bitfield id="ECC_SEL" width="1" begin="7" end="7" resetval="0x0" description="ECC Data Width Select bitThis bit selects between whether the ECC computation is done on 16-bit or 32-bit words. 0h [R/W] = 32-bit ECC is used.1h [R/W] = 16-bit ECC is used." range="7" rwaccess="R/W"/> 
		<bitfield id="N_WORDS" width="4" begin="6" end="3" resetval="0x0" description="Number of Words to ReceiveThis field defines the number of words which will be received in a DATA_N_WORD frame. This is a user-defined field that must match the corresponding field in the transmitter. Set this bitfield to be one less than the number of words to be received. This value is only applicable when the frame type received is DATA_N_WORD. 0h [R/W] = 1 data word frame [16-bit data].1h [R/W] = 2 data word frame [32-bit data]...Fh [R/W] = 16 data word frame [256-bit data]." range="6 - 3" rwaccess="R/W"/> 
		<bitfield id="SPI_MODE" width="1" begin="2" end="2" resetval="0x0" description="SPI Mode Enable bitThis bit enables and disables the SPI compatibility mode of the FSI RX. The received data must be formatted as an FSI frame in order for the data to properly be received. SPI compatibility mode will allow FSI RX to receive data that is sent using SPI signal format. Refer to the applicable section in the FSI TRM chapter for more information. 0h [R/W] = FSI is in normal mode of operation.1h [R/W] = FSI is operating in SPI compatibility mode." range="2" rwaccess="R/W"/> 
		<bitfield id="DATA_WIDTH" width="2" begin="1" end="0" resetval="0x0" description="Receive Data Width Select bitThese bits decide the number of data lines used for receiving data.  0h [R/W] = Data will be received on one data line, RXD0.1h [R/W] = Data will be received on two data lines, RXD0 and RXD1.2h, 3h [R/W] = Reserved" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_Reserved_4" acronym="CFG_Reserved_4" offset="0xA" width="16" description="">
		
	</register>
	<register id="CFG_RX_FRAME_INFO" acronym="CFG_RX_FRAME_INFO" offset="0xC" width="16" description="Receive frame control register">
		<bitfield id="FRAME_TYPE" width="4" begin="3" end="0" resetval="0x0" description="Received Frame TypeThis field indicates the type of frame that was successfully received last. 0000b [R/W] = A ping frame was received0100b [R/W] = A DATA_1_WORD frame was received [16-bit data].0101b [R/W] = A DATA_2_WORD frame was received [32-bit data].0110b [R/W] = A DATA_4_WORD frame was received [64-bit data]. 0111b [R/W] = A DATA_6_WORD frame was received [96-bit data].0011b [R/W] = A DATA_N_WORD frame was received. The N_WORD field will determine the number of words [1 to 16] to be sent. The number of words received must equal the value programmed in RX_OPER_CTRL.N_WORDS. 1111b [R/W] = An error frame was received. This frame can be used during error conditions or any condition where the transmitter wants to signal the receiver for attention. However, the user software is at liberty to use this for any purpose. 0001b, 0010b, and 1000b through 1110b are Reserved and should not be used." range="3 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_RX_FRAME_TAG_UDATA" acronym="CFG_RX_FRAME_TAG_UDATA" offset="0xE" width="16" description="Receive frame tag and user data register">
		<bitfield id="USER_DATA" width="8" begin="15" end="8" resetval="0x0" description="Received User DataThis field contains the 8-bit user data field of the last successfully received frame." range="15 - 8" rwaccess="R"/> 
		<bitfield id="FRAME_TAG" width="4" begin="4" end="1" resetval="0x0" description="Received Frame TagThis field contains the 4-bit frame tag from the last successfully received frame. This is intentionally shifted into bits 4:1 so that the register can be used as a 32-bit address index based on the received tag." range="4 - 1" rwaccess="R"/> 
		<bitfield id="ZERO" width="1" begin="0" end="0" resetval="0x0" description="Zero bitThis bit will always read  as 0. This is intentionally provided to create a 32-bit offset if required. Using the FRAME_TAG  and ZERO bits of this register [bits 4:0], application software can directly index into an array of 32-bit data." range="0" rwaccess="R"/>
	</register>
