IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/FSIRX4_CFG.xml
	<register id="CFG_RX_BUF_PTR_STS" acronym="CFG_RX_BUF_PTR_STS" offset="0x1E" width="16" description="Receive buffer pointer status register">
		<bitfield id="CURR_WORD_CNT" width="5" begin="12" end="8" resetval="0x0" description="Words Available in the Receive BufferThis bitfield indicates the number of valid data words present in the receive buffer that have not been read by the application software. This bitfield is only valid when there is no active transfer. Note: This value will not be valid if there has been a buffer overrun or underrun condition." range="12 - 8" rwaccess="R"/> 
		<bitfield id="CURR_BUF_PTR" width="4" begin="3" end="0" resetval="0x0" description="Current Buffer Pointer IndexThis bitfield will show the current index of the buffer pointer. This value is only valid when there is no active transmission." range="3 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_RX_FRAME_WD_CTRL" acronym="CFG_RX_FRAME_WD_CTRL" offset="0x20" width="16" description="Receive frame watchdog control register. Protected by LOCK field in RX_LOCK_CTRL register.">
		<bitfield id="FRAME_WD_EN" width="1" begin="1" end="1" resetval="0x0" description="Frame Watchdog Counter Enable bitThis bit will enable or disable the frame watchdog counter. The counter [RX_FRAME_WD_CNT] will begin counting from 0 when a valid start-of-frame pattern is received. When the reference value [RX_FRAME_WD_REF] is reached, it will generate a frame watchdog timeout event [RX_EVT_STS.FRAME_WD_TO] and the counter value will reset to 0 and continue counting on the next valid start-of-frame. 0h [R/W] = The frame watchdog counter is disabled and not running.1h [R/W] = The frame watchdog counter logic is enabled and running." range="1" rwaccess="R/W"/> 
		<bitfield id="FRAME_WD_CNT_RST" width="1" begin="0" end="0" resetval="0x0" description="Frame Watchdog Counter Reset bitThis bit will reset the frame watchdog counter to 0. This bit will always be read as 0. 0h [R/W] = Writing a 0 to this bit has no effect.1h [W] = The frame watchdog counter will be reset to 0." range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_Reserved_6" acronym="CFG_Reserved_6" offset="0x22" width="16" description="">
		
	</register>
	<register id="CFG_RX_FRAME_WD_REF" acronym="CFG_RX_FRAME_WD_REF" offset="0x24" width="32" description="Receive frame watchdog counter reference. Protected by LOCK field in RX_LOCK_CTRL register.">
		<bitfield id="FRAME_WD_REF" width="32" begin="31" end="0" resetval="0x0" description="Frame Watchdog Counter Reference ValueThis is the 32-bit reference value for the frame watchdog timeout counter. The counter will count up starting from 0 at a valid start-of-frame pattern and continue counting until this value is reached." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_RX_FRAME_WD_CNT" acronym="CFG_RX_FRAME_WD_CNT" offset="0x28" width="32" description="Receive frame watchdog current count">
		<bitfield id="FRAME_WD_CNT" width="32" begin="31" end="0" resetval="0x0" description="Frame Watchdog Counter ValueThis is the 32-bit read-only register which shows the current value of the frame watchdog counter. This counter is reset to 0 in a variety of ways: A write to FRME_WD_CNT_RST, a match with FRAME_WD_REF, or the reception of a successful data frame." range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_RX_PING_WD_CTRL" acronym="CFG_RX_PING_WD_CTRL" offset="0x2C" width="16" description="Receive ping watchdog control register. Protected by LOCK field in RX_LOCK_CTRL register.">
		<bitfield id="PING_WD_EN" width="1" begin="1" end="1" resetval="0x0" description="Ping Watchdog Counter Enable bitThis bit will enable or disable the ping watchdog counter. The counter [RX_PING_WD_CNT] will begin counting from 0 when it is enabled. When the reference value [RX_PING_WD_REF] is reached, it will generate a ping watchdog timeout event [RX_EVT_STS.PING_WD_TO] and the counter value will reset to 0, and resume counting 0h [R/W] = The ping watchdog counter is disabled and not running.1h [R/W] = The ping watchdog counter logic is enabled and running." range="1" rwaccess="R/W"/> 
		<bitfield id="PING_WD_RST" width="1" begin="0" end="0" resetval="0x0" description="Ping Watchdog Counter Reset bitThis bit will reset the ping watchdog counter to 0. This bit will always be read as 0. 0h [R/W] = Writing a 0 to this bit has no effect.1h [W] = The ping watchdog counter will be reset to 0." range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_RX_PING_TAG" acronym="CFG_RX_PING_TAG" offset="0x2E" width="16" description="Receive ping tag register">
		<bitfield id="PING_TAG" width="4" begin="4" end="1" resetval="0x0" description="Received Ping Frame TagThis field contains the 4-bit frame tag from the last successfully received ping frame. This is intentionally shifted into bits 4:1 so that the register can be used as a 32-bit address index based on the received tag." range="4 - 1" rwaccess="R"/> 
		<bitfield id="ZERO" width="1" begin="0" end="0" resetval="0x0" description="Zero bitThis bit will always read  as 0. This is intentionally provided to create a 32-bit offset if required. Using the PING_TAG  and ZERO bits of this register [bits 4:0], application software can directly index into an array of 32-bit data." range="0" rwaccess="R"/>
	</register>
	<register id="CFG_RX_PING_WD_REF" acronym="CFG_RX_PING_WD_REF" offset="0x30" width="32" description="Receive ping watchdog counter reference. Protected by LOCK field in RX_LOCK_CTRL register.">
		<bitfield id="PING_WD_REF" width="32" begin="31" end="0" resetval="0x0" description="Ping Watchdog Counter Reference ValueThis is the 32-bit reference value for the ping watchdog timeout counter. The counter will count up starting from 0 and continue counting until this value is reached. " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_RX_PING_WD_CNT" acronym="CFG_RX_PING_WD_CNT" offset="0x34" width="32" description="Receive pingwatchdog current count">
		<bitfield id="PING_WD_CNT" width="32" begin="31" end="0" resetval="0x0" description="Ping Watchdog Counter ValueThis is the 32-bit read-only register which shows the current value of the ping watchdog counter. This counter is reset to 0 in a variety of ways: A write to PING_WD_RST, a match with PING_WD_REF, or the reception of a ping frame." range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_RX_INT1_CTRL_ALT1_" acronym="CFG_RX_INT1_CTRL_ALT1_" offset="0x38" width="16" description="Receive interrupt control register for RX_INT1. Protected by LOCK field in RX_LOCK_CTRL register.">
		<bitfield id="INT1_EN_ERROR_TAG_MATCH" width="1" begin="14" end="14" resetval="0x0" description="Enable Error Frame Received with Tag Match Interrupt to INT1 bitThis is an enable register which decides whether an interrupt [RX_INT1] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT1.1h [R/W] = An error frame received with matching tag will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="14" rwaccess="R/W"/> 
		<bitfield id="INT1_EN_DATA_TAG_MATCH" width="1" begin="13" end="13" resetval="0x0" description="Enable Data Frame Received with Tag Match Interrupt to INT1 bitThis is an enable register which decides whether an interrupt [RX_INT1] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT1.1h [R/W] = A data frame received with matching tag will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="13" rwaccess="R/W"/> 
		<bitfield id="INT1_EN_PING_TAG_MATCH" width="1" begin="12" end="12" resetval="0x0" description="Enable Ping Frame Received with Tag Match Interrupt to INT1 bitThis is an enable register which decides whether an interrupt [RX_INT1] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT1.1h [R/W] = A ping frame received with matching tag will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="12" rwaccess="R/W"/> 
		<bitfield id="INT1_EN_DATA_FRAME" width="1" begin="11" end="11" resetval="0x0" description="Enable Data Frame Received Interrupt to INT1 bitThis is an enable register which decides whether an interrupt [RX_INT1] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT1.1h [R/W] = A data frame received event will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="11" rwaccess="R/W"/> 
		<bitfield id="INT1_EN_FRAME_OVERRUN" width="1" begin="10" end="10" resetval="0x0" description="Enable Frame Overrun Interrupt to INT1 bitThis is an enable register which decides whether an interrupt [RX_INT1] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT1.1h [R/W] = A frame overrun event will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="10" rwaccess="R/W"/> 
		<bitfield id="INT1_EN_PING_FRAME" width="1" begin="9" end="9" resetval="0x0" description="Enable Ping Frame Received Interrupt to INT1 bitThis is an enable register which decides whether an interrupt [RX_INT1] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT1.1h [R/W] = A ping frame received event will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="9" rwaccess="R/W"/> 
		<bitfield id="INT1_EN_ERR_FRAME" width="1" begin="8" end="8" resetval="0x0" description="Enable ERROR Frame Received Interrupt to INT1 bitThis is an enable register which decides whether an interrupt [RX_INT1] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT1.1h [R/W] = A error frame received event will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="8" rwaccess="R/W"/> 
		<bitfield id="INT1_EN_UNDERRUN" width="1" begin="7" end="7" resetval="0x0" description="Enable Buffer Underrun Interrupt to INT1 bitThis is an enable register which decides whether an interrupt [RX_INT1] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT1.1h [R/W] = A buffer underrun event will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="7" rwaccess="R/W"/> 
		<bitfield id="INT1_EN_FRAME_DONE" width="1" begin="6" end="6" resetval="0x0" description="Enable Frame Done Interrupt to INT1 bitThis is an enable register which decides whether an interrupt [RX_INT1] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT1.1h [R/W] = A frame done event will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="6" rwaccess="R/W"/> 
		<bitfield id="INT1_EN_OVERRUN" width="1" begin="5" end="5" resetval="0x0" description="Enable Receive Buffer Overrun Interrupt to INT1 bitThis is an enable register which decides whether an interrupt [RX_INT1] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT1.1h [R/W] = A receive buffer overrun event will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="5" rwaccess="R/W"/> 
		<bitfield id="INT1_EN_EOF_ERR" width="1" begin="4" end="4" resetval="0x0" description="Enable End-of-Frame Error Interrupt to INT1 bitThis is an enable register which decides whether an interrupt [RX_INT1] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT1.1h [R/W] = An end-of-frame error event will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="4" rwaccess="R/W"/> 
		<bitfield id="INT1_EN_TYPE_ERR" width="1" begin="3" end="3" resetval="0x0" description="Enable Frame Type Error Interrupt to INT1 bitThis is an enable register which decides whether an interrupt [RX_INT1] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT1.1h [R/W] = A frame type error event will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="3" rwaccess="R/W"/> 
		<bitfield id="INT1_EN_CRC_ERR" width="1" begin="2" end="2" resetval="0x0" description="Enable CRC Error Interrupt to INT1 bitThis is an enable register which decides whether an interrupt [RX_INT1] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT1.1h [R/W] = A CRC error will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="2" rwaccess="R/W"/> 
		<bitfield id="INT1_EN_FRAME_WD_TO" width="1" begin="1" end="1" resetval="0x0" description="Enable Frame Watchdog Timeout Interrupt to INT1 bitThis is an enable register which decides whether an interrupt [RX_INT1] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT1.1h [R/W] = A frame watchdog timeout event will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="1" rwaccess="R/W"/> 
		<bitfield id="INT1_EN_PING_WD_TO" width="1" begin="0" end="0" resetval="0x0" description="Enable Ping Watchdog Timeout Interrupt to INT1 bitThis is an enable register which decides whether an interrupt [RX_INT1] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT1.1h [R/W] = A ping watchdog timeout event will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_RX_INT2_CTRL_ALT1_" acronym="CFG_RX_INT2_CTRL_ALT1_" offset="0x3A" width="16" description="Receive interrupt control register for RX_INT2. Protected by LOCK field in RX_LOCK_CTRL register.">
		<bitfield id="INT2_EN_ERROR_TAG_MATCH" width="1" begin="14" end="14" resetval="0x0" description="Enable Error Frame Received with Tag Match Interrupt to INT2 bitThis is an enable register which decides whether an interrupt [RX_INT2] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT2.1h [R/W] = An error frame received with matching tag will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="14" rwaccess="R/W"/> 
		<bitfield id="INT2_EN_DATA_TAG_MATCH" width="1" begin="13" end="13" resetval="0x0" description="Enable Data Frame Received with Tag Match Interrupt to INT2 bitThis is an enable register which decides whether an interrupt [RX_INT2] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT2.1h [R/W] = A data frame received with matching tag will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="13" rwaccess="R/W"/> 
		<bitfield id="INT2_EN_PING_TAG_MATCH" width="1" begin="12" end="12" resetval="0x0" description="Enable Ping Frame Received with Tag Match Interrupt to INT2 bitThis is an enable register which decides whether an interrupt [RX_INT2] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT2.1h [R/W] = A ping frame received with matching tag will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="12" rwaccess="R/W"/> 
		<bitfield id="INT2_EN_DATA_FRAME" width="1" begin="11" end="11" resetval="0x0" description="Enable Data Frame Received Interrupt to INT2 bitThis is an enable register which decides whether an interrupt [RX_INT2] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT2.1h [R/W] = A data frame received event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="11" rwaccess="R/W"/> 
		<bitfield id="INT2_EN_FRAME_OVERRUN" width="1" begin="10" end="10" resetval="0x0" description="Enable Frame Overrun Interrupt to INT2 bitThis is an enable register which decides whether an interrupt [RX_INT2] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT2.1h [R/W] = A frame overrun event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="10" rwaccess="R/W"/> 
		<bitfield id="INT2_EN_PING_FRAME" width="1" begin="9" end="9" resetval="0x0" description="Enable Ping Frame Received Interrupt to INT2 bitThis is an enable register which decides whether an interrupt [RX_INT2] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT2.1h [R/W] = A ping frame received event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="9" rwaccess="R/W"/> 
		<bitfield id="INT2_EN_ERR_FRAME" width="1" begin="8" end="8" resetval="0x0" description="Enable Error Frame Received Interrupt to INT2 bitThis is an enable register which decides whether an interrupt [RX_INT2] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT2.1h [R/W] = A error frame received event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="8" rwaccess="R/W"/> 
		<bitfield id="INT2_EN_UNDERRUN" width="1" begin="7" end="7" resetval="0x0" description="Enable Buffer Underrun Interrupt to INT2 bitThis is an enable register which decides whether an interrupt [RX_INT2] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT2.1h [R/W] = A buffer underrun event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="7" rwaccess="R/W"/> 
		<bitfield id="INT2_EN_FRAME_DONE" width="1" begin="6" end="6" resetval="0x0" description="Enable Frame Done Interrupt to INT2 bitThis is an enable register which decides whether an interrupt [RX_INT2] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT2.1h [R/W] = A frame done event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="6" rwaccess="R/W"/> 
		<bitfield id="INT2_EN_OVERRUN" width="1" begin="5" end="5" resetval="0x0" description="Enable Buffer Overrun Interrupt to INT2 bitThis is an enable register which decides whether an interrupt [RX_INT2] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT2.1h [R/W] = A buffer overrun event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="5" rwaccess="R/W"/> 
		<bitfield id="INT2_EN_EOF_ERR" width="1" begin="4" end="4" resetval="0x0" description="Enable End-of-Frame Error Interrupt to INT2 bitThis is an enable register which decides whether an interrupt [RX_INT2] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT2.1h [R/W] = An end-of-frame error event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="4" rwaccess="R/W"/> 
		<bitfield id="INT2_EN_TYPE_ERR" width="1" begin="3" end="3" resetval="0x0" description="Enable Frame Type Error Interrupt to INT2 bitThis is an enable register which decides whether an interrupt [RX_INT2] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT2.1h [R/W] = A frame type error event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="3" rwaccess="R/W"/> 
		<bitfield id="INT2_EN_CRC_ERR" width="1" begin="2" end="2" resetval="0x0" description="Enable CRC Error Interrupt to INT2 bitThis is an enable register which decides whether an interrupt [RX_INT2] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT2.1h [R/W] = A CRC error will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="2" rwaccess="R/W"/> 
		<bitfield id="INT2_EN_FRAME_WD_TO" width="1" begin="1" end="1" resetval="0x0" description="Enable Frame Watchdog Timeout Interrupt to INT2 bitThis is an enable register which decides whether an interrupt [RX_INT2] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT2.1h [R/W] = A frame watchdog timeout event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="1" rwaccess="R/W"/> 
		<bitfield id="INT2_EN_PING_WD_TO" width="1" begin="0" end="0" resetval="0x0" description="Enable Ping Watchdog Timeout Interrupt to INT2 bitThis is an enable register which decides whether an interrupt [RX_INT2] will be generated on the enabled event. 0h [R/W] = This event will not trigger an interrupt on RX_INT2.1h [R/W] = A ping watchdog timeout event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_RX_LOCK_CTRL" acronym="CFG_RX_LOCK_CTRL" offset="0x3C" width="16" description="Receive lock control register">
		<bitfield id="KEY" width="8" begin="15" end="8" resetval="0x0" description="Write Key.In order to write to this register, 0xA5 must be written to this field at the same time. Otherwise, writes are ignored. The key is cleared immediately after writing, so it must be written again for every change to this register." range="15 - 8" rwaccess="W"/> 
		<bitfield id="LOCK" width="1" begin="0" end="0" resetval="0x0" description="Control Register Lock Enable bitThis bit locks the contents of all the receive control registers that support a lock protection. Once locked, further writes will not take effect until SYSRS unlocks the register. Once set, further writes even to this bit will be ignored. 0h [R/W] = Receive control registers can be modified and are not locked.1h [R/W] = Receive control registers are locked and cannot be modified until this bit is cleared by SYSRS. Any further writes to this bit are ignored. Note: The KEY field must contatin 0xA5 for any write to this bit to take effect." range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_Reserved_7" acronym="CFG_Reserved_7" offset="0x3E" width="16" description="">
		
	</register>
